In [21]:
import sqlite3
import pandas as pd

In [2]:
cd zippedData/

C:\Users\joshu\Documents\Flatiron\phase1_project\dsc-phase-1-project-v2-4\zippedData

In [3]:
cd im.db/

C:\Users\joshu\Documents\Flatiron\phase1_project\dsc-phase-1-project-v2-4\zippedData\im.db

In [4]:
conn = sqlite3.connect('im.db')

In [5]:
cur = conn.cursor()
cur.execute("""SELECT name FROM sqlite_master WHERE type = 'table';""")

table_names = cur.fetchall()
table_names

[('movie_basics',),
 ('directors',),
 ('known_for',),
 ('movie_akas',),
 ('movie_ratings',),
 ('persons',),
 ('principals',),
 ('writers',)]

In [35]:
directors = pd.read_sql("""
SELECT primary_name, primary_profession, primary_title, genres, averagerating, numvotes
  FROM directors
JOIN persons
    ON persons.person_id = directors.person_id
JOIN movie_basics
    ON movie_basics.movie_id = directors.movie_id
JOIN movie_ratings
    ON movie_ratings.movie_id = directors.movie_id
ORDER BY averagerating DESC
;
""", conn)
directors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181387 entries, 0 to 181386
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   primary_name        181387 non-null  object
 1   primary_profession  181262 non-null  object
 2   primary_title       181387 non-null  object
 3   genres              180047 non-null  object
 4   averagerating       181387 non-null  float64
 5   numvotes            181387 non-null  int64
dtypes: float64(1), int64(1), object(4)
memory usage: 8.3+ MB

In [36]:
Spielberg = directors.loc[directors['primary_name'].str.contains('Spielberg')]
Spielberg.drop_duplicates(subset=['primary_title'])

,primary_name,primary_profession,primary_title,genres,averagerating,numvotes
27563,Steven Spielberg,"producer,writer,director",Bridge of Spies,"Drama,History,Thriller",7.6,263004
28368,Steven Spielberg,"producer,writer,director",Ready Player One,"Action,Adventure,Sci-Fi",7.5,301660
33637,Steven Spielberg,"producer,writer,director",Lincoln,"Biography,Drama,History",7.4,228701
37528,Steven Spielberg,"producer,writer,director",The Adventures of Tintin,"Action,Adventure,Animation",7.3,202430
42813,Steven Spielberg,"producer,writer,director",War Horse,"Drama,History,War",7.2,136447
43665,Steven Spielberg,"producer,writer,director",The Post,"Biography,Drama,History",7.2,108017
87735,Steven Spielberg,"producer,writer,director",The BFG,"Adventure,Family,Fantasy",6.4,69340

In [37]:
writers = pd.read_sql("""
SELECT primary_name, primary_profession, primary_title, genres, averagerating, numvotes
  FROM writers
JOIN persons
    ON persons.person_id = writers.person_id
JOIN movie_basics
    ON movie_basics.movie_id = writers.movie_id
JOIN movie_ratings
    ON movie_ratings.movie_id = writers.movie_id
ORDER BY averagerating DESC
;
""", conn)
writers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169302 entries, 0 to 169301
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   primary_name        169302 non-null  object
 1   primary_profession  169138 non-null  object
 2   primary_title       169302 non-null  object
 3   genres              168184 non-null  object
 4   averagerating       169302 non-null  float64
 5   numvotes            169302 non-null  int64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.8+ MB

In [41]:
Quentin = writers.loc[writers['primary_name'].str.contains('Quentin Taran')]
Quentin.drop_duplicates(subset=['primary_title'])

,primary_name,primary_profession,primary_title,genres,averagerating,numvotes
25,Quentin Tarantino,"writer,actor,producer",Once Upon a Time ... in Hollywood,"Comedy,Drama",9.7,5600
3146,Quentin Tarantino,"writer,actor,producer",Kill Bill: The Whole Bloody Affair,"Action,Crime,Thriller",8.8,3406
6909,Quentin Tarantino,"writer,actor,producer",Django Unchained,"Drama,Western",8.4,1211405
16260,Quentin Tarantino,"writer,actor,producer",The Hateful Eight,"Crime,Drama,Mystery",7.8,434966

In [42]:
famousppl = pd.read_sql("""
SELECT primary_name, primary_profession, primary_title, genres, averagerating, numvotes
  FROM known_for
JOIN persons
    ON persons.person_id = known_for.person_id
JOIN movie_basics
    ON movie_basics.movie_id = known_for.movie_id
JOIN movie_ratings
    ON movie_ratings.movie_id = known_for.movie_id
ORDER BY averagerating DESC
;
""", conn)
famousppl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526728 entries, 0 to 526727
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   primary_name        526728 non-null  object
 1   primary_profession  506036 non-null  object
 2   primary_title       526728 non-null  object
 3   genres              523276 non-null  object
 4   averagerating       526728 non-null  float64
 5   numvotes            526728 non-null  int64
dtypes: float64(1), int64(1), object(4)
memory usage: 24.1+ MB

In [48]:
Brad_Pitt = famousppl.loc[famousppl['primary_name'].str.contains('Brad Pitt')]
Brad_Pitt.drop_duplicates(subset=['primary_title'])

,primary_name,primary_profession,primary_title,genres,averagerating,numvotes
89783,Brad Pitt,"actor,producer,soundtrack",Moneyball,"Biography,Drama,Sport",7.6,326657
175170,Brad Pitt,"actor,producer,soundtrack",World War Z,"Action,Adventure,Horror",7.0,553751